using tyuiu.denisovld.sprint1.Task5.V6.Lib;

DataService ds = new DataService();

Console.OutputEncoding = System.Text.Encoding.UTF8;
Console.Title = "Спринт 1 | Выполнено by Денисов Л. Д. | АСОиУб-26-1";
Console.WriteLine("*************************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                     *");
Console.WriteLine("* Тема: Преобразование типов и класс Convert                                                    *");
Console.WriteLine("* Задание #5                                                                                    *");
Console.WriteLine("* Вариант #6                                                                                    *");
Console.WriteLine("* Выполнено by Денисов Л. Д. | АСОиУб-26-1                                                      *");
Console.WriteLine("*************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                      *");
Console.WriteLine("* Написать программу, которая решает следующую задачу:                                          *");
Console.WriteLine("* Пусть k – целое от 1 до 365. Присвоить целой переменной n значение 1,2,...,7                  *");
Console.WriteLine("* в зависимости от того, на какой день недели (понедельник, вторник,..., воскресенье)           *");
Console.WriteLine("* приходится k-й день невисокосного года, в котором 1 января – понедельник.                     *");
Console.WriteLine("*                                                                                               *");
Console.WriteLine("*************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                              *");
Console.WriteLine("*************************************************************************************************");

int k;
Console.WriteLine("Введите значение k от 1 до 365:");
k = Convert.ToInt32(Console.ReadLine());


Console.WriteLine("*************************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                    *");
Console.WriteLine("*************************************************************************************************");

Console.WriteLine("Номер дня недели = " + ds.Calculate(k));